/* 1. Составьте список пользователей users, которые осуществили хотя бы один заказ orders в интернет магазине.*/

SELECT * FROM orders;
| id | user_id | created_at          | updated_at          |
+----+---------+---------------------+---------------------+
|  1 |       1 | 2020-06-30 11:08:14 | 2020-06-30 11:08:14 |
|  2 |       5 | 2020-06-30 11:08:14 | 2020-06-30 11:08:14 |
|  3 |      19 | 2020-06-30 11:08:14 | 2020-06-30 11:08:14 |
|  4 |     100 | 2020-06-30 11:08:14 | 2020-06-30 11:08:14 |
|  5 |       1 | 2020-06-30 11:11:47 | 2020-06-30 11:11:47 |
|  6 |       2 | 2020-06-30 11:11:47 | 2020-06-30 11:11:47 |
|  7 |      18 | 2020-06-30 11:11:47 | 2020-06-30 11:11:47 |
|  8 |     100 | 2020-06-30 11:11:47 | 2020-06-30 11:11:47 |
|  9 |       1 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 10 |       2 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 11 |       3 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 12 |       4 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 13 |       5 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 14 |       6 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 15 |       6 | 2020-06-30 11:22:46 | 2020-06-30 11:22:46 |
| 16 |       1 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 17 |       2 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 18 |       3 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 19 |       4 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 20 |       5 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 21 |       6 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
| 22 |       6 | 2020-06-30 11:29:00 | 2020-06-30 11:29:00 |
+----+---------+---------------------+---------------------+

SELECT (SELECT id FROM users WHERE user_id = users.id ) AS `user_id`,
	(SELECT name FROM users WHERE user_id = users.id ) AS `name_user`, 
	COUNT(*) AS total_orders 
FROM orders o2
WHERE user_id IN (SELECT id FROM users u2)
GROUP BY user_id;
+---------+--------------------+--------------+
| user_id | name_user          | total_orders |
+---------+--------------------+--------------+
|       1 | Геннадий           |            4 |
|       2 | Наталья            |            3 |
|       3 | Александр          |            2 |
|       4 | Сергей             |            2 |
|       5 | Иван               |            3 |
|       6 | Мария              |            4 |
+---------+--------------------+--------------+

/*Выведите список товаров products и разделов catalogs, который соответствует товару.*/

mysql> SELECT * FROM catalogs;
+----+-------------------------------------+
| id | name                                |
+----+-------------------------------------+
|  1 | Процессоры                          |
|  2 | Материнские платы                   |
|  3 | Видеокарты                          |
|  4 | Жесткие диски                       |
|  5 | Оперативная память                  |
+----+-------------------------------------+
mysql> SELECT * FROM products;
+----+-------------------------+-----------------------------------------------------------------------+----------+------------+---------------------+---------------------+
| id | name                    | description                                                           | price    | catalog_id | created_at          | updated_at          |
+----+-------------------------+-----------------------------------------------------------------------+----------+------------+---------------------+---------------------+
|  1 | Intel Core i3-8100      | CPU for PC in Intel.                                                  |  7890.00 |          1 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  2 | Intel Core i5-7400      | CPU for PC in Intel.                                                  | 12700.00 |          1 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  3 | AMD FX-8320E            | CPU for PC in AMD.                                                    |  4780.00 |          1 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  4 | AMD FX-8320             | CPU for PC in AMD.                                                    |  7120.00 |          1 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  5 | ASUS ROG MAXIMUS X HERO | Mother Board ASUS ROG MAXIMUS X HERO, Z370, Socket 1151-V2, DDR4, ATX | 19310.00 |          2 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  6 | Gigabyte H310M S2H      | Mother Board Gigabyte H310M S2H, H310, Socket 1151-V2, DDR4, mATX     |  4790.00 |          2 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
|  7 | MSI B250M GAMING PRO    | Mother Board MSI B250M GAMING PRO, B250, Socket 1151, DDR4, mATX      |  5060.00 |          2 | 2020-06-23 12:40:30 | 2020-06-23 12:40:30 |
+----+-------------------------+-----------------------------------------------------------------------+----------+------------+---------------------+---------------------+

SELECT id, name, description,
	(SELECT name FROM catalogs WHERE id = products.catalog_id) as `catalog`
FROM products;

+----+-------------------------+-----------------------------------------------------------------------+-----------------------------------+
| id | name                    | description                                                           | catalog                           |
+----+-------------------------+-----------------------------------------------------------------------+-----------------------------------+
|  1 | Intel Core i3-8100      | CPU for PC in Intel.                                                  | Процессоры                        |
|  2 | Intel Core i5-7400      | CPU for PC in Intel.                                                  | Процессоры                        |
|  3 | AMD FX-8320E            | CPU for PC in AMD.                                                    | Процессоры                        |
|  4 | AMD FX-8320             | CPU for PC in AMD.                                                    | Процессоры                        |
|  5 | ASUS ROG MAXIMUS X HERO | Mother Board ASUS ROG MAXIMUS X HERO, Z370, Socket 1151-V2, DDR4, ATX | Материнские платы                 |
|  6 | Gigabyte H310M S2H      | Mother Board Gigabyte H310M S2H, H310, Socket 1151-V2, DDR4, mATX     | Материнские платы                 |
|  7 | MSI B250M GAMING PRO    | Mother Board MSI B250M GAMING PRO, B250, Socket 1151, DDR4, mATX      | Материнские платы                 |
+----+-------------------------+-----------------------------------------------------------------------+-----------------------------------+

/* 3. (по желанию) Пусть имеется таблица рейсов flights (id, from, to) и таблица городов cities (label, name). 
Поля from, to и label содержат английские названия городов, поле name — русское. Выведите список рейсов flights 
с русскими названиями городов.*/ 

drop table if exists flights;
create table flights (
	`id` SERIAL,
	`from` VARCHAR(255),
	`to` VARCHAR(255) 
);

insert into flights (`from`,`to`)
values ('moscow','omsk'),('novgorod','kazan'),('irkutsk','moscow'),('omsk','irkutsk'),('moscow','kazan');
mysql> select * from flights;
+----+----------+---------+
| id | from     | to      |
+----+----------+---------+
|  1 | moscow   | omsk    |
|  2 | novgorod | kazan   |
|  3 | irkutsk  | moscow  |
|  4 | omsk     | irkutsk |
|  5 | moscow   | kazan   |
+----+----------+---------+

drop table if exists cities;
create table cities(
	label VARCHAR(255),
	name VARCHAR(255) 
);
mysql> select * from cities;
+----------+------------------+
| label    | name             |
+----------+------------------+
| moscow   | Москва           |
| novgorod | Новгород         |
| irkutsk  | Иркутск          |
| omsk     | Омск             |
| kazan    | Казань           |
+----------+------------------+

insert into cities (`label`,`name`)
values ('moscow','Москва'),('novgorod','Новгород'),('irkutsk','Иркутск'),('omsk','Омск'),('kazan','Казань');

select id,
	(SELECT name from cities c2 where label = `from`) as `Откуда`,
	(SELECT name from cities c2 where label = `to`) as `Куда`
from flights; 
+----+------------------+----------------+
| id | Откуда           | Куда           |
+----+------------------+----------------+
|  1 | Москва           | Омск           |
|  2 | Новгород         | Казань         |
|  3 | Иркутск          | Москва         |
|  4 | Омск             | Иркутск        |
|  5 | Москва           | Казань         |
+----+------------------+----------------+

























































